In [5]:
import os
os.getcwd()

'C:\\Users\\STUDENTS\\Documents'

In [6]:
import pandas as pd
pd.read_excel("Book1.xlsx")

     First   UON  Good  Yes  Y
0    First   UON  Good   No  Y
1   Second   UON  Good   No  Y
2   Second   UON  Good  Yes  Y
3   Second   MOI  Good   No  Y
4   Second    KU  Good   No  Y
5   Second    KU  Good   No  N
6   Second   UON  Good   No  N
7     Pass   MOI   Bad  Yes  N
8     Pass   UON   Bad   No  N
9     Pass    KU  Good   No  N
10    Pass    KU  Good   No  N
11   First  KCAU  Good  Yes  Y
12  Second  KCAU  Good  Yes  Y
13  Second  KCAU   Bad  Yes  Y

In [23]:
df = pd.read_csv("Book1.csv", header=None)
df

         0     1     2    3  4
0    First   UON  Good  Yes  Y
1    First   UON  Good   No  Y
2   Second   UON  Good   No  Y
3   Second   UON  Good  Yes  Y
4   Second   MOI  Good   No  Y
5   Second    KU  Good   No  Y
6   Second    KU  Good   No  N
7   Second   UON  Good   No  N
8     Pass   MOI   Bad  Yes  N
9     Pass   UON   Bad   No  N
10    Pass    KU  Good   No  N
11    Pass    KU  Good   No  N
12   First  KCAU  Good  Yes  Y
13  Second  KCAU  Good  Yes  Y
14  Second  KCAU   Bad  Yes  Y

In [2]:
with open("Book1.csv", "r") as fopen:
    print(fopen.read())

First,UON,Good,Yes,Y
First,UON,Good,No,Y
Second,UON,Good,No,Y
Second,UON,Good,Yes,Y
Second,MOI,Good,No,Y
Second,KU,Good,No,Y
Second,KU,Good,No,N
Second,UON,Good,No,N
Pass,MOI,Bad,Yes,N
Pass,UON,Bad,No,N
Pass,KU,Good,No,N
Pass,KU,Good,No,N
First,KCAU,Good,Yes,Y
Second,KCAU,Good,Yes,Y
Second,KCAU,Bad,Yes,Y

In [1]:
with open("Book1.csv", "w") as fopen:
    fopen.write("""First,UON,Good,Yes,Y
First,UON,Good,No,Y
Second,UON,Good,No,Y
Second,UON,Good,Yes,Y
Second,MOI,Good,No,Y
Second,KU,Good,No,Y
Second,KU,Good,No,N
Second,UON,Good,No,N
Pass,MOI,Bad,Yes,N
Pass,UON,Bad,No,N
Pass,KU,Good,No,N
Pass,KU,Good,No,N
First,KCAU,Good,Yes,Y
Second,KCAU,Good,Yes,Y
Second,KCAU,Bad,Yes,Y
""")

In [24]:
len(df)

15

In [12]:
df.head()

    First  UON  Good  Yes  Y
0   First  UON  Good   No  Y
1  Second  UON  Good   No  Y
2  Second  UON  Good  Yes  Y
3  Second  MOI  Good   No  Y
4  Second   KU  Good   No  Y

In [13]:
df.tail()

     First   UON  Good  Yes  Y
9     Pass    KU  Good   No  N
10    Pass    KU  Good   No  N
11   First  KCAU  Good  Yes  Y
12  Second  KCAU  Good  Yes  Y
13  Second  KCAU   Bad  Yes  Y

In [27]:
df.sample(n=2)

  Degree_class University letter Experience hired
7       Second        UON   Good         No     N
3       Second        UON   Good        Yes     Y

In [17]:
df[["First", "Good"]]

     First  Good
0    First  Good
1   Second  Good
2   Second  Good
3   Second  Good
4   Second  Good
5   Second  Good
6   Second  Good
7     Pass   Bad
8     Pass   Bad
9     Pass  Good
10    Pass  Good
11   First  Good
12  Second  Good
13  Second   Bad

In [28]:
df.columns=["Degree_class","University","letter","Experience","hired"]
display(len(df))
df.sample(n=7)

15

   Degree_class University letter Experience hired
13       Second       KCAU   Good        Yes     Y
10         Pass         KU   Good         No     N
7        Second        UON   Good         No     N
4        Second        MOI   Good         No     Y
5        Second         KU   Good         No     Y
2        Second        UON   Good         No     Y
11         Pass         KU   Good         No     N

In [29]:
df.columns==["Degree_class","University","letter","Experience","hired"]

array([ True,  True,  True,  True,  True])

In [32]:
df["Degree_class"]

0      First
1      First
2     Second
3     Second
4     Second
5     Second
6     Second
7     Second
8       Pass
9       Pass
10      Pass
11      Pass
12     First
13    Second
14    Second
Name: Degree_class, dtype: object

In [35]:
df["Degree_class"].where(df["Degree_class"].str.contains("F"))

0     First
1     First
2       NaN
3       NaN
4       NaN
5       NaN
6       NaN
7       NaN
8       NaN
9       NaN
10      NaN
11      NaN
12    First
13      NaN
14      NaN
Name: Degree_class, dtype: object

In [36]:
df[df["Degree_class"]=="First"]

   Degree_class University letter Experience hired
0         First        UON   Good        Yes     Y
1         First        UON   Good         No     Y
12        First       KCAU   Good        Yes     Y

In [37]:
df.dtypes

Degree_class    object
University      object
letter          object
Experience      object
hired           object
dtype: object

In [38]:
df.count()

Degree_class    15
University      15
letter          15
Experience      15
hired           15
dtype: int64

In [39]:
df.sum()

Degree_class    FirstFirstSecondSecondSecondSecondSecondSecond...
University           UONUONUONUONMOIKUKUUONMOIUONKUKUKCAUKCAUKCAU
letter          GoodGoodGoodGoodGoodGoodGoodGoodBadBadGoodGood...
Experience                   YesNoNoYesNoNoNoNoYesNoNoNoYesYesYes
hired                                             YYYYYYNNNNNNYYY
dtype: object

In [40]:
df.describe()

       Degree_class University letter Experience hired
count            15         15     15         15    15
unique            3          4      2          2     2
top          Second        UON   Good         No     Y
freq              8          6     12          9     9

In [79]:
df2 = pd.read_csv("Book2.csv")
df2

    A   B   C
0  78  25  95
1  89  52  41
2  33  59  51
3  62  48  25
4  89  81  20

In [103]:
len(df2)

5

In [5]:
with(open("Book2.csv", "r")) as fopen:
    print(fopen.read())

A,B,C
78,25,95
89,52,41
33,59,51
62,48,25
89,81,20

In [4]:
with open("Book2.csv", "w") as fopen:
    fopen.write("""A,B,C
78,25,95
89,52,41
33,59,51
62,48,25
89,81,20""")

In [80]:
df2.dtypes

A    int64
B    int64
C    int64
dtype: object

In [81]:
df2.describe()

              A          B          C
count   5.00000   5.000000   5.000000
mean   70.20000  53.000000  46.400000
std    23.55207  20.186629  29.863021
min    33.00000  25.000000  20.000000
25%    62.00000  48.000000  25.000000
50%    78.00000  52.000000  41.000000
75%    89.00000  59.000000  51.000000
max    89.00000  81.000000  95.000000

In [82]:
df2.mean()

A    70.2
B    53.0
C    46.4
dtype: float64

In [83]:
df2.mode()

      A   B   C
0  89.0  25  20
1   NaN  48  25
2   NaN  52  41
3   NaN  59  51
4   NaN  81  95

In [84]:
df2.median()

A    78.0
B    52.0
C    41.0
dtype: float64

In [85]:
df2.count()

A    5
B    5
C    5
dtype: int64

In [86]:
df2.min()

A    33
B    25
C    20
dtype: int64

In [87]:
df2.max()

A    89
B    81
C    95
dtype: int64

In [89]:
type(df2.max()[0])

numpy.int64

In [90]:
df2.std()

A    23.552070
B    20.186629
C    29.863021
dtype: float64

In [95]:
df2[:-1]

    A   B   C
0  78  25  95
1  89  52  41
2  33  59  51
3  62  48  25

In [99]:
help(encoder.fit_transform)

Help on method fit_transform in module sklearn.preprocessing._label:

fit_transform(y) method of sklearn.preprocessing._label.LabelEncoder instance
    Fit label encoder and return encoded labels.

    Parameters
    ----------
    y : array-like of shape (n_samples,)
        Target values.

    Returns
    -------
    y : array-like of shape (n_samples,)

In [101]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder

encoder=LabelEncoder()
edf=df.apply(encoder.fit_transform)
edf

    Degree_class  University  letter  Experience  hired
0              0           3       1           1      1
1              0           3       1           0      1
2              2           3       1           0      1
3              2           3       1           1      1
4              2           2       1           0      1
5              2           1       1           0      1
6              2           1       1           0      0
7              2           3       1           0      0
8              1           2       0           1      0
9              1           3       0           0      0
10             1           1       1           0      0
11             1           1       1           0      0
12             0           0       1           1      1
13             2           0       1           1      1
14             2           0       0           1      1